# Практическая работа №2
## "Развертывание коммутируемой сети с резервными каналами"
#### Подробную информацию условиям практической работы можно посмотреть в файле - ["Техническое задание"](https://github.com/Maksim693/OTUS_LAB/blob/main/Practical_LAB/LAB_2/%D0%A2%D0%B5%D1%85%D0%BD%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%BE%D0%B5%20%D0%B7%D0%B0%D0%B4%D0%B0%D0%BD%D0%B8%D0%B5.pdf)

### *Table of Contents*
- [Создание сети и настройка основных параметров устройства](#создание-сети-и-настройка-основных-параметров-устройства)
  - [Шаг 1:	Создайте сеть согласно топологии](#шаг-1создайте-сеть-согласно-топологии)
  - [Шаг 2: Выполните инициализацию и перезагрузку коммутаторов](#шаг-2выполните-инициализацию-и-перезагрузку-коммутаторов)
  - [Шаг 3: Настройте базовые параметры каждого коммутатора](#шаг-3настройте-базовые-параметры-каждого-коммутатора)
  - [Шаг 4: Проверьте связь](#шаг-4проверьте-связь)
- [Определение корневого моста](#определение-корневого-моста)
  - [Шаг 1: Отключите все порты на коммутаторах](#шаг-1отключите-все-порты-на-коммутаторах)
  - [Шаг 2: Настройте подключенные порты в качестве транковых](#шаг-2настройте-подключенные-порты-в-качестве-транковых)
  - [Шаг 3: Включите порты F0/2 и F0/4 на всех коммутаторах](#шаг-3включите-порты-f02-и-f04-на-всех-коммутаторах)
  - [Шаг 4: Отобразите данные протокола spanning-tree](#шаг-4отобразите-данные-протокола-spanning-tree)
- [Наблюдение за процессом выбора протоколом STP порта, исходя из стоимости портов](#наблюдение-за-процессом-выбора-протоколом-stp-порта-исходя-из-стоимости-портов)
  - [Шаг 1: Определите коммутатор с заблокированным портом](#шаг-1определите-коммутатор-с-заблокированным-портом)
  - [Шаг 2: Измените стоимость порта](#шаг-2измените-стоимость-порта)
  - [Шаг 3: Просмотрите изменения протокола spanning-tree](#шаг-3просмотрите-изменения-протокола-spanning-tree)
  - [Шаг 4: Удалите изменения стоимости порта](#шаг-4удалите-изменения-стоимости-порта)
- [Наблюдение за процессом выбора протоколом STP порта, исходя из приоритета портов](#наблюдение-за-процессом-выбора-протоколом-stp-порта-исходя-из-приоритета-портов)
- [Вопросы для повторения](#вопросы-для-повторения)
>
- [Итоговая конфигурация (CPT)](https://github.com/Maksim693/OTUS_LAB/blob/main/Practical_LAB/LAB_2/CPT-LAB2.pkt)

## Создание сети и настройка основных параметров устройства
##### В части 1 вам предстоит настроить топологию сети и основные параметры маршрутизаторов.
#### Шаг 1:	Создайте сеть согласно топологии.
Подключите устройства, как показано в топологии, и подсоедините необходимые кабели.
#### Шаг 2:	Выполните инициализацию и перезагрузку коммутаторов.
#### Шаг 3:	Настройте базовые параметры каждого коммутатора.
> Настройка будет показана на примере свитча S1. На свитчах S2 и S3 конфигурация будет идентична.
- [x] Отключите поиск DNS.
- [x] Присвойте имена устройствам в соответствии с топологией.
- [x] Назначьте class в качестве зашифрованного пароля доступа к привилегированному режиму.
- [x] Назначьте cisco в качестве паролей консоли и VTY и активируйте вход для консоли и VTY каналов.
- [x] Настройте logging synchronous для консольного канала.
- [x] Настройте баннерное сообщение дня (MOTD) для предупреждения пользователей о запрете несанкционированного доступа.
```
S1(config)#hostname S1
S1(config)#service password-encryption
S1(config)#enable secret class
S1(config)#clock timezone msk 3
S1(config)#no ip domain-lookup
S1(config)#banner motd ^C Authorized Users Only! ^C
S1(config)#line con 0
S1(config-line)#password cisco
S1(config-line)#login
S1(config)#line vty 0 4
S1(config-line)#password cisco
S1(config-line)#login
S1#copy running-config startup-config 
```
- [x] Задайте IP-адрес, указанный в таблице адресации для VLAN 1 на всех коммутаторах.
```
S1(config)#interface Vlan1
S1(config-if)#ip address 192.168.1.1 255.255.255.0
S1(config-if)#no shutdown
```
- [x] Скопируйте текущую конфигурацию в файл загрузочной конфигурации.
```
S1#copy running-config st
S1#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
```
#### Шаг 4:	Проверьте связь.
##### Проверьте способность компьютеров обмениваться эхо-запросами.
- [x] Успешно ли выполняется эхо-запрос от коммутатора S1 на коммутатор S2?
```
S1#ping 192.168.1.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 0/1/7 ms
```
- [x] Успешно ли выполняется эхо-запрос от коммутатора S1 на коммутатор S3?
```
S1#ping 192.168.1.3

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 0/0/0 ms
```
- [x] Успешно ли выполняется эхо-запрос от коммутатора S2 на коммутатор S3?
```
S2#ping 192.168.1.3

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 0/0/0 ms
```
###### Выполняйте отладку до тех пор, пока ответы на все вопросы не будут положительными.
## Определение корневого моста
##### Для каждого экземпляра протокола spanning-tree (коммутируемая сеть LAN или широковещательный домен) существует коммутатор, выделенный в качестве корневого моста. Корневой мост служит точкой привязки для всех расчётов протокола spanning-tree, позволяя определить избыточные пути, которые следует заблокировать.
##### Процесс выбора определяет, какой из коммутаторов станет корневым мостом. Коммутатор с наименьшим значением идентификатора моста (BID) становится корневым мостом. Идентификатор BID состоит из значения приоритета моста, расширенного идентификатора системы и MAC-адреса коммутатора. Значение приоритета может находиться в диапазоне от 0 до 65535 с шагом 4096. По умолчанию используется значение 32768.
>Выполняем следующие команду для всех коммутаторов - S1, S2 и S3
#### Шаг 1:	Отключите все порты на коммутаторах.
```
S1(config)#interface range f0/1-24,gi0/1-2
S1(config-if)#shutdown
```
#### Шаг 2:	Настройте подключенные порты в качестве транковых.
```
S1(config)#interface range f0/1-4
S1(config-if)#switchport mode trunk
```
#### Шаг 3:	Включите порты F0/2 и F0/4 на всех коммутаторах.
```
S1(config)#interface range f0/2, f0/4
S1(config-if)#no shutdown
```
#### Шаг 4:	Отобразите данные протокола spanning-tree.
##### Введите команду show spanning-tree на всех трех коммутаторах. Приоритет идентификатора моста рассчитывается путем сложения значений приоритета и расширенного идентификатора системы. Расширенным идентификатором системы всегда является номер сети VLAN. В примере ниже все три коммутатора имеют равные значения приоритета идентификатора моста (32769 = 32768 + 1, где приоритет по умолчанию = 32768, номер сети VLAN = 1); следовательно, коммутатор с самым низким значением MAC-адреса становится корневым мостом (в примере — S2).
```
S1#show spanning-tree 
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0060.5CD6.22ED
             This bridge is the root
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     0060.5CD6.22ED
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20

Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/2            Desg FWD 19        128.2    P2p
Fa0/4            Desg FWD 19        128.4    P2p
```
```
S2#show spanning-tree 
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0060.5CD6.22ED
             Cost        19
             Port        2(FastEthernet0/2)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     00D0.BC70.9CD7
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20

Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/2            Root FWD 19        128.2    P2p
Fa0/4            Altn BLK 19        128.4    P2p
```
```
S3#sh spanning-tree 
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0060.5CD6.22ED
             Cost        19
             Port        4(FastEthernet0/4)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     0090.2153.81DB
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20

Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/2            Desg FWD 19        128.2    P2p
Fa0/4            Root FWD 19        128.4    P2p
```
#### С учетом выходных данных, поступающих с коммутаторов, ответьте на следующие вопросы.
- [x] Какой коммутатор является корневым мостом?
> Свитч S1 является корневым
- [x] Почему этот коммутатор был выбран протоколом spanning-tree в качестве корневого моста?
> Свитч S1 является корневым по причине того, что его MAC-Адрес является наименьшим.
- [x] Какие порты на коммутаторе являются корневыми портами?
> На S1 нет root поротов, т.к. свитч является корневым. На S2 root портом является - Fa0/2. На S3 root портом является - Fa0/4
- [x] Какие порты на коммутаторе являются назначенными портами?
> На S1 designeted портом является - Fa0/2 и Fa0/4. На S2 нет designeted портов. На S3 designeted портом является - Fa0/2
- [x] Какой порт отображается в качестве альтернативного и в настоящее время заблокирован?
> На S1 нет alternative портоd является. На S2 alternative портом является - Fa0/4. На нет S3 alternative портов.
- [x] Почему протокол spanning-tree выбрал этот порт в качестве невыделенного (заблокированного) порта?
> Alternative порт выбирается исходя из стоимости порта отправителя. В данному случае стоимость порта на S2 Fa0/4 выше стоимости порта Fa 0/3 на свитче S3
>
## Наблюдение за процессом выбора протоколом STP порта, исходя из стоимости портов
##### Алгоритм протокола spanning-tree (STA) использует корневой мост как точку привязки, после чего определяет, какие порты будут заблокированы, исходя из стоимости пути. Порт с более низкой стоимостью пути является предпочтительным. Если стоимости портов равны, процесс сравнивает BID. Если BID равны, для определения корневого моста используются приоритеты портов. Наиболее низкие значения являются предпочтительными. В части 3 вам предстоит изменить стоимость порта, чтобы определить, какой порт будет заблокирован протоколом spanning-tree.
#### Шаг 1:	Определите коммутатор с заблокированным портом.
##### При текущей конфигурации только один коммутатор может содержать заблокированный протоколом STP порт. 
##### Выполните команду show spanning-tree на обоих коммутаторах некорневого моста.
```
S2#show spanning-tree 
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0060.5CD6.22ED
             Cost        19
             Port        2(FastEthernet0/2)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     00D0.BC70.9CD7
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20

Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/2            Root FWD 19        128.2    P2p
Fa0/4            Altn BLK 19        128.4    P2p
```
###### Примечание. В конкретной топологии корневой мост может отличаться от выбора порта.
#### Шаг 2:	Измените стоимость порта.
##### Помимо заблокированного порта, единственным активным портом на этом коммутаторе является порт, выделенный в качестве порта корневого моста. Уменьшите стоимость этого порта корневого моста до 18, выполнив команду spanning-tree cost 18 режима конфигурации интерфейса.
```
S2(config)# interface f0/2
S2(config-if)# spanning-tree cost 18
```
#### Шаг 3:	Просмотрите изменения протокола spanning-tree.
- [x] Повторно выполните команду show spanning-tree на обоих коммутаторах некорневого моста.
```
S2#show spanning-tree 
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0060.5CD6.22ED
             Cost        18
             Port        2(FastEthernet0/2)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     00D0.BC70.9CD7
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20

Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/2            Root FWD 18        128.2    P2p
Fa0/4            Desg FWD 19        128.4    P2p
```
```
S3#show spanning-tree 
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0060.5CD6.22ED
             Cost        19
             Port        4(FastEthernet0/4)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     0090.2153.81DB
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20

Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/2            Altn BLK 19        128.2    P2p
Fa0/4            Root FWD 19        128.4    P2p
```
#### Шаг 4:	Удалите изменения стоимости порта.
- [x] Выполните команду no spanning-tree cost 18 режима конфигурации интерфейса, чтобы удалить запись стоимости, созданную ранее.
```
S1(config)# interface f0/2
S1(config-if)# no spanning-tree cost 18
```
- [x] Повторно выполните команду show spanning-tree, чтобы подтвердить, что протокол STP сбросил порт на коммутаторе некорневого моста, вернув исходные настройки порта. 
###### Протоколу STP требуется примерно 30 секунд, чтобы завершить процесс перевода порта.
```
S2#show spanning-tree 
Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/2            Root FWD 19        128.2    P2p
Fa0/4            Altn BLK 19        128.4    P2p
```
## Наблюдение за процессом выбора протоколом STP порта, исходя из приоритета портов
##### Если стоимости портов равны, процесс сравнивает BID. Если BID равны, для определения корневого моста используются приоритеты портов. Значение приоритета по умолчанию — 128. STP объединяет приоритет порта с номером порта, чтобы разорвать связи. Наиболее низкие значения являются предпочтительными. В части 4 вам предстоит активировать избыточные пути до каждого из коммутаторов, чтобы просмотреть, каким образом протокол STP выбирает порт с учетом приоритета портов.
- [x] Включите порты F0/1 и F0/3 на всех коммутаторах.
> На всех свитчах выполняем следующую команду
```
S1(config)#interface range f0/1, f0/3
S1(config-if)#no shutdown
```
- [x] Подождите 30 секунд, чтобы протокол STP завершил процесс перевода порта, после чего выполните команду show spanning-tree на коммутаторах некорневого моста.
```
S2#sh spanning-tree 
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0060.5CD6.22ED
             Cost        19
             Port        1(FastEthernet0/1)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     00D0.BC70.9CD7
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20

Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/2            Altn BLK 19        128.2    P2p
Fa0/3            Altn BLK 19        128.3    P2p
Fa0/4            Altn BLK 19        128.4    P2p
Fa0/1            Root FWD 19        128.1    P2p
```
```
S3#show spanning-tree 
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0060.5CD6.22ED
             Cost        19
             Port        3(FastEthernet0/3)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     0090.2153.81DB
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20

Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/2            Desg FWD 19        128.2    P2p
Fa0/3            Root FWD 19        128.3    P2p
Fa0/1            Desg FWD 19        128.1    P2p
Fa0/4            Altn BLK 19        128.4    P2p
```
##### Обратите внимание, что порт корневого моста переместился на порт с меньшим номером, связанный с коммутатором корневого моста, и заблокировал предыдущий порт корневого моста.
1. Какой порт выбран протоколом STP в качестве порта корневого моста на каждом коммутаторе некорневого моста?
> В качестве root порта на S2 был выбран - Fa0/1. В качестве root порта на S2 был выбран - Fa0/3
2. Почему протокол STP выбрал эти порты в качестве портов корневого моста на этих коммутаторах?
> Данные порты были выбраны в качесте root по причине того что они находся ближе всего к корневому свитча, также их стоимости. При одинаковой стоимости, в данному случае, будет сравниваться идентификатор порта. На S2 порт Fa0/1 меньше Fa0/2. На S3 порт Fa0/3 меньше Fa0/4.
## Вопросы для повторения
1. Какое значение протокол STP использует первым после выбора корневого моста, чтобы определить выбор порта?
> Root Past Cost - стоимость маршрута до корневого свитча
2. Если первое значение на двух портах одинаково, какое следующее значение будет использовать протокол STP при выборе порта?
> Port ID - идентификатор порта. Приоритет будет отдан наимешему значению. Например Fa0/1 меньше Fa0/2
3.	Если оба значения на двух портах равны, каким будет следующее значение, которое использует протокол STP при выборе порта?
> MAC-Адрес порта. Приоритет будет отдан порту с наименьшим значение.
